results/rest/stage-10000/payload-small/200VUs/repeat-2/200vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rest/restTest.js
        output: json (./results/rest/stage-10000/payload-small/200VUs/repeat-2/200vus.json)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 200 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 442 complete and 0 interrupted iterations
default   [   2% ] 200 VUs  0m01.0s/1m0s

running (0m02.0s), 200/200 VUs, 1197 complete and 0 interrupted iterations
default   [   3% ] 200 VUs  0m02.0s/1m0s

running (0m03.0s), 200/200 VUs, 1966 complete and 0 interrupted iterations
default   [   5% ] 200 VUs  0m03.0s/1m0s

running (0m04.0s), 200/200 VUs, 2747 complete and 0 interrupted iterations
default   [   7% ] 200 VUs  0m04.0s/1m0s

running (0m05.0s), 200/200 VUs, 3558 complete and 0 interrupted iterations
default   [   8% ] 200 VUs  0m05.0s/1m0s

running (0m06.0s), 200/200 VUs, 4356 complete and 0 interrupted iterations
default   [  10% ] 200 VUs  0m06.0s/1m0s

running (0m07.0s), 200/200 VUs, 5168 complete and 0 interrupted iterations
default   [  12% ] 200 VUs  0m07.0s/1m0s

running (0m08.0s), 200/200 VUs, 5992 complete and 0 interrupted iterations
default   [  13% ] 200 VUs  0m08.0s/1m0s

running (0m07.1s), 200/200 VUs, 6781 complete and 0 interrupted iterations
default   [  15% ] 200 VUs  0m09.0s/1m0s

running (0m08.1s), 200/200 VUs, 7561 complete and 0 interrupted iterations
default   [  17% ] 200 VUs  0m10.0s/1m0s

running (0m09.1s), 200/200 VUs, 8359 complete and 0 interrupted iterations
default   [  18% ] 200 VUs  0m11.0s/1m0s

running (0m10.1s), 200/200 VUs, 9162 complete and 0 interrupted iterations
default   [  20% ] 200 VUs  0m12.0s/1m0s

running (0m11.1s), 200/200 VUs, 9952 complete and 0 interrupted iterations
default   [  22% ] 200 VUs  0m13.0s/1m0s

running (0m12.1s), 200/200 VUs, 10785 complete and 0 interrupted iterations
default   [  23% ] 200 VUs  0m14.0s/1m0s

running (0m13.1s), 200/200 VUs, 11600 complete and 0 interrupted iterations
default   [  25% ] 200 VUs  0m15.0s/1m0s

running (0m14.1s), 200/200 VUs, 12409 complete and 0 interrupted iterations
default   [  27% ] 200 VUs  0m16.0s/1m0s

running (0m15.1s), 200/200 VUs, 13234 complete and 0 interrupted iterations
default   [  28% ] 200 VUs  0m17.0s/1m0s

running (0m16.1s), 200/200 VUs, 14043 complete and 0 interrupted iterations
default   [  30% ] 200 VUs  0m18.0s/1m0s

running (0m17.1s), 200/200 VUs, 14820 complete and 0 interrupted iterations
default   [  32% ] 200 VUs  0m19.0s/1m0s

running (0m18.1s), 200/200 VUs, 15596 complete and 0 interrupted iterations
default   [  33% ] 200 VUs  0m20.0s/1m0s

running (0m19.1s), 200/200 VUs, 16393 complete and 0 interrupted iterations
default   [  35% ] 200 VUs  0m21.0s/1m0s

running (0m20.1s), 200/200 VUs, 17172 complete and 0 interrupted iterations
default   [  37% ] 200 VUs  0m22.0s/1m0s

running (0m21.1s), 200/200 VUs, 17953 complete and 0 interrupted iterations
default   [  38% ] 200 VUs  0m23.0s/1m0s

running (0m22.1s), 200/200 VUs, 18756 complete and 0 interrupted iterations
default   [  40% ] 200 VUs  0m24.0s/1m0s

running (0m23.1s), 200/200 VUs, 19535 complete and 0 interrupted iterations
default   [  42% ] 200 VUs  0m25.0s/1m0s

running (0m24.1s), 200/200 VUs, 20336 complete and 0 interrupted iterations
default   [  43% ] 200 VUs  0m26.0s/1m0s

running (0m25.1s), 200/200 VUs, 21115 complete and 0 interrupted iterations
default   [  45% ] 200 VUs  0m27.0s/1m0s

running (0m26.1s), 200/200 VUs, 21888 complete and 0 interrupted iterations
default   [  47% ] 200 VUs  0m28.0s/1m0s

running (0m27.1s), 200/200 VUs, 22692 complete and 0 interrupted iterations
default   [  48% ] 200 VUs  0m29.0s/1m0s

running (0m28.1s), 200/200 VUs, 23461 complete and 0 interrupted iterations
default   [  50% ] 200 VUs  0m30.0s/1m0s

running (0m29.1s), 200/200 VUs, 24256 complete and 0 interrupted iterations
default   [  52% ] 200 VUs  0m31.0s/1m0s

running (0m30.1s), 200/200 VUs, 25050 complete and 0 interrupted iterations
default   [  53% ] 200 VUs  0m32.0s/1m0s

running (0m31.1s), 200/200 VUs, 25836 complete and 0 interrupted iterations
default   [  55% ] 200 VUs  0m33.0s/1m0s

running (0m32.1s), 200/200 VUs, 26609 complete and 0 interrupted iterations
default   [  57% ] 200 VUs  0m34.0s/1m0s

running (0m33.1s), 200/200 VUs, 27416 complete and 0 interrupted iterations
default   [  58% ] 200 VUs  0m35.0s/1m0s

running (0m34.1s), 200/200 VUs, 28211 complete and 0 interrupted iterations
default   [  60% ] 200 VUs  0m36.0s/1m0s

running (0m35.1s), 200/200 VUs, 29001 complete and 0 interrupted iterations
default   [  62% ] 200 VUs  0m37.0s/1m0s

running (0m36.1s), 200/200 VUs, 29780 complete and 0 interrupted iterations
default   [  63% ] 200 VUs  0m38.0s/1m0s

running (0m35.2s), 200/200 VUs, 30592 complete and 0 interrupted iterations
default   [  65% ] 200 VUs  0m39.0s/1m0s

running (0m36.2s), 200/200 VUs, 31373 complete and 0 interrupted iterations
default   [  67% ] 200 VUs  0m40.0s/1m0s

running (0m37.2s), 200/200 VUs, 32145 complete and 0 interrupted iterations
default   [  68% ] 200 VUs  0m41.0s/1m0s

running (0m38.2s), 200/200 VUs, 32928 complete and 0 interrupted iterations
default   [  70% ] 200 VUs  0m42.0s/1m0s

running (0m39.2s), 200/200 VUs, 33699 complete and 0 interrupted iterations
default   [  72% ] 200 VUs  0m43.0s/1m0s

running (0m40.2s), 200/200 VUs, 34472 complete and 0 interrupted iterations
default   [  73% ] 200 VUs  0m44.0s/1m0s

running (0m41.2s), 200/200 VUs, 35265 complete and 0 interrupted iterations
default   [  75% ] 200 VUs  0m45.0s/1m0s

running (0m42.2s), 200/200 VUs, 36056 complete and 0 interrupted iterations
default   [  77% ] 200 VUs  0m46.0s/1m0s

running (0m43.2s), 200/200 VUs, 36838 complete and 0 interrupted iterations
default   [  78% ] 200 VUs  0m47.0s/1m0s

running (0m44.2s), 200/200 VUs, 37647 complete and 0 interrupted iterations
default   [  80% ] 200 VUs  0m48.0s/1m0s

running (0m45.2s), 200/200 VUs, 38455 complete and 0 interrupted iterations
default   [  82% ] 200 VUs  0m49.0s/1m0s

running (0m46.2s), 200/200 VUs, 39246 complete and 0 interrupted iterations
default   [  83% ] 200 VUs  0m50.0s/1m0s

running (0m47.2s), 200/200 VUs, 40065 complete and 0 interrupted iterations
default   [  85% ] 200 VUs  0m51.0s/1m0s

running (0m48.2s), 200/200 VUs, 40845 complete and 0 interrupted iterations
default   [  87% ] 200 VUs  0m52.0s/1m0s

running (0m49.2s), 200/200 VUs, 41624 complete and 0 interrupted iterations
default   [  88% ] 200 VUs  0m53.0s/1m0s

running (0m50.2s), 200/200 VUs, 42419 complete and 0 interrupted iterations
default   [  90% ] 200 VUs  0m54.0s/1m0s

running (0m51.2s), 200/200 VUs, 43221 complete and 0 interrupted iterations
default   [  92% ] 200 VUs  0m55.0s/1m0s

running (0m52.2s), 200/200 VUs, 44011 complete and 0 interrupted iterations
default   [  93% ] 200 VUs  0m56.0s/1m0s

running (0m53.2s), 200/200 VUs, 44842 complete and 0 interrupted iterations
default   [  95% ] 200 VUs  0m57.0s/1m0s

running (0m54.2s), 200/200 VUs, 45644 complete and 0 interrupted iterations
default   [  97% ] 200 VUs  0m58.0s/1m0s

running (0m55.2s), 200/200 VUs, 46442 complete and 0 interrupted iterations
default   [  98% ] 200 VUs  0m59.0s/1m0s

running (0m56.2s), 200/200 VUs, 47259 complete and 0 interrupted iterations
default   [ 100% ] 200 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 0.05%  24 out of 47468
    benchmark_total_failure_rate...: 0.05%  24 out of 47468

    HTTP
    http_req_duration..............: avg=249.11ms min=18.77µs  med=250.49ms max=1.31s p(90)=264.56ms p(95)=269.53ms
      { expected_response:true }...: avg=249.11ms min=18.77µs  med=250.49ms max=1.31s p(90)=264.56ms p(95)=269.53ms
    http_req_failed................: 0.00%  0 out of 47468
    http_reqs......................: 47468  841.52302/s

    EXECUTION
    iteration_duration.............: avg=253.22ms min=210.65ms med=250.66ms max=1.31s p(90)=264.84ms p(95)=269.79ms
    iterations.....................: 47468  841.52302/s
    vus............................: 200    min=200         max=200
    vus_max........................: 200    min=200         max=200

    NETWORK
    data_received..................: 12 MB  210 kB/s
    data_sent......................: 7.4 MB 131 kB/s



running (0m56.4s), 000/200 VUs, 47468 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  1m0s